# @Time    : 
# @Author  : chen

#%% 数学运算
print(abs(-2))
print(divmod(5.0, 2))
print(max(1,2,3))
print(max('1234'))# 传入1个可迭代对象，取其最大元素值
print(max(-1,0,key = abs)) #传入了求绝对值函数，则参数都会进行求绝对值后再取较大者
'''幂函数，所有的参数必须是数值类型；如果x,y有一个是浮点数，则结果将转换成浮点数；
如果可选参数z传入了值，x,y必须为整数，且y不能为负数'''
print(pow(2,3))
print(2**3)
print(pow(2,3,5))
print(pow(2,3)%5)
#%%
'''round函数用于对浮点数进行四舍五入求值，具体保留几位小数，以传入的ndigits参数来控制,
默认保留0位小数进行取整，返回的是整数'''
print(round(123456.1314926,5))
print(round(123456.1314926))
print(round(123456.1314926,0))
print(round(123456.1314926,1))
print(round(123456.1314926,-1))
print(round(123456.1314926,-5))
print(round(0.5)) #round四舍五入时是遵循靠近0原则，所以-0.5和0.5进行0位四舍五入，返回的都是0
print(round(-0.5))
'''对于浮点数求四舍五入有一个陷阱，有些四舍五入结果不像预期那样，比如round(2.675, 2) 的结果是2.67
而不是预期的 2.68，这不是bug，而是浮点数在存储的时候因为位数有限，实际存储的值和显示的值有一定误差。'''
print(round(2.675, 2))
#%%
# sum：对元素类型是数值的可迭代对象中的每个元素求和
# 函数功能是对可迭代类型进行求和。要求：① 接收对象是可迭代类型。② 可迭代对象所有元素类型是数值型。
print(sum((1,2,3,4)))
print(sum([1,2,3,4]))
print(sum(range(10)))
sum((1,2,3,4),-10)
# 传入空可迭代对象，直接返回初始值
print(sum([],2))
#%%
# bool：根据传入的参数的逻辑值创建一个新的布尔值
print(bool()) #未传入参数

# 传入布尔类型时，按原值返回
print(bool(False))
print(bool(True))
# 传入字符串时，空字符串返回False，否则返回True
print(bool(''))
print(bool('aa'))
# 传入数值时，0值返回False，否则返回True
print(bool(0))
print(bool(2))
# 传入元组、列表、字典等对象时，元素个数为空返回False，否则返回True
# int：根据传入的参数创建一个新的整数